// Редактирование условия (стены, вход, выход) +
// Загрузка/сохранение условия в файл +
// Загрузка/сохранение решения в файл +
// Кнопки и окна загрузки/сохранения +
// Отображение итогового счёта и состояний роботов +
// подсветка роботов и действия при наведении на панель состояний роботов +
// Множители скорости воспроизведения +
// Клетки-брейкпоинты +
// Разнообразить цвета
// Заполнить свойства exe +
// Добавить ярлык +
// Значок скорости воспроизведения, значок остановки +
// Редактирование после остановки воспроизведения +
// Изменение количества роботов
// Переписать через общий стейт, разрешить более удобное редактирование +
// Статы решения: количество роботов, добравшизся до выхода, количество карт, время, за которое первый робот добрался до выхода(?)
// Поиск цикла, зацикливание воспроизведения +
// Сервер со статистикой (?)
// Изменение скорости по клику, а не только драгом +
// Серии заданий
// Размер карточек +